In [1]:
import pandas as pd
import numpy as np

## Series

In [7]:
rand = np.random.RandomState(42) #seeding
A = pd.Series(rand.randint(0,10,3))
B = pd.Series(rand.randint(0,10,4))
A,B

(0    6
 1    3
 2    7
 dtype: int32, 0    4
 1    6
 2    9
 3    2
 dtype: int32)

In [14]:
A+B

0    10.0
1     9.0
2    16.0
3     NaN
dtype: float64

In [13]:
A.add(B,fill_value=0) #use add not sum

0    10.0
1     9.0
2    16.0
3     2.0
dtype: float64

## Data frames

In [18]:
da = pd.DataFrame(rand.randint(0,10,(2,2)),columns=list('AB'))
print(da)
db = pd.DataFrame(rand.randint(0,10,(3,3)),columns=list('ABC'))
print(db)

   A  B
0  6  1
1  3  8
   A  B  C
0  1  9  8
1  9  4  1
2  3  6  7

In [19]:
da+db

      A     B   C
0   7.0  10.0 NaN
1  12.0  12.0 NaN
2   NaN   NaN NaN

In [20]:
da.add(db,fill_value=0)

      A     B    C
0   7.0  10.0  8.0
1  12.0  12.0  1.0
2   3.0   6.0  7.0

### Fill with mean in A

In [27]:
a_mean = da.stack().mean()
da.add(db,fill_value=a_mean)

      A     B     C
0   7.0  10.0  12.5
1  12.0  12.0   5.5
2   7.5  10.5  11.5

In [38]:
A = pd.DataFrame(np.full((3,3),10,dtype=np.float64),columns = list('ABC'))
A

      A     B     C
0  10.0  10.0  10.0
1  10.0  10.0  10.0
2  10.0  10.0  10.0

In [33]:
s = pd.Series(np.ones(3))
s

0    1.0
1    1.0
2    1.0
dtype: float64

In [47]:
# row wise broadcasting works
print(A.iloc[0])
A-A.iloc[0]

A    10.0
B    10.0
C    10.0
Name: 0, dtype: float64

     A    B    C
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0

In [48]:
A-s # does not work. subtraction is row wise
#thinks of s as row. Hence indexes of s are thought to be columns

    A   B   C   0   1   2
0 NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN

In [45]:
np.full((3,3),10)-np.ones(3)

array([[9., 9., 9.],
       [9., 9., 9.],
       [9., 9., 9.]])

In [46]:
A.subtract(s,axis=0) #this works

     A    B    C
0  9.0  9.0  9.0
1  9.0  9.0  9.0
2  9.0  9.0  9.0

In [50]:
A.loc[0,::2] #first row, alternate column

A    10.0
C    10.0
Name: 0, dtype: float64

In [62]:
A.iloc[0,0::2]

A    10.0
C    10.0
Name: 0, dtype: float64

In [63]:
A-A.iloc[0,0::2]

     A   B    C
0  0.0 NaN  0.0
1  0.0 NaN  0.0
2  0.0 NaN  0.0